IRP/src/InformationRegisters/IntegrationInfo/IntegrationInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>IntegrationInfo</name>
 <resources>
  <name>Value</name>
  <type>
   <types>String</types>
  </type>
 </resources>
 <resources>
  <name>SecondValue</name>
  <type>
   <types>Boolean</types>
   <types>String</types>
   <types>Date</types>
   <types>Number</types>
   <types>AnyRef</types>
   <numberQualifiers>
    <precision>15</precision>
    <scale>5</scale>
   </numberQualifiers>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </resources>
 <dimensions>
  <name>isProduct</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IntegrationSettings</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Key</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonModules/IntegrationServerPrivileged/Module.bsl
Procedure SaveSettingsInInfoReg(SettingsTab) Export
	isProduct = ServiceSystemServer.isProduction();
	
	For Each Row In SettingsTab Do
	
		Reg = InformationRegisters.IntegrationInfo.CreateRecordSet();
		Reg.Filter.IntegrationSettings.Set(Row.IntegrationSettings);
		Reg.Filter.Key.Set(Row.Key);
		Reg.Filter.isProduct.Set(isProduct);
		If Not ValueIsFilled(Row.Value) And Row.SecondValue = Undefined Then
			Reg.Write();
			Continue;
		EndIf;
		NewRow = Reg.Add();
		FillPropertyValues(NewRow, Row);
		NewRow.isProduct = isProduct;
		Reg.Write();

	EndDo;

EndProcedure

Procedure ClearSettingsInInfoReg(IntegrationSettings) Export
	
	If Not ValueIsFilled(IntegrationSettings) Then
		Raise IntegrationSettings;
	EndIf;
	
	isProduct = ServiceSystemServer.isProduction();
	Reg = InformationRegisters.IntegrationInfo.CreateRecordSet();
	Reg.Filter.IntegrationSettings.Set(IntegrationSettings);
	Reg.Filter.isProduct.Set(isProduct);
	Reg.Write();
	
EndProcedure
